# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\_User\GitHub Projects\PulseGen\PulseGen.cywrk_.Archive01\Design93\PulseGenerator.cydsn\PulseGenerator.cyprj
# Date: Thu, 12 Aug 2021 20:35:57 GMT
#set_units -time ns
create_clock -name {Clock_1(routed)} -period 5000000 -waveform {0 2500000} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 120001 240001} [list [get_pins {ClockBlock/dclk_glb_0}]]


# Component constraints for C:\_User\GitHub Projects\PulseGen\PulseGen.cywrk_.Archive01\Design93\PulseGenerator.cydsn\TopDesign\TopDesign.cysch
# Project: C:\_User\GitHub Projects\PulseGen\PulseGen.cywrk_.Archive01\Design93\PulseGenerator.cydsn\PulseGenerator.cyprj
# Date: Thu, 12 Aug 2021 20:35:54 GMT
